<?php
// 1. Створення змінних та виведення речення

$name = "Настя"; // ім'я
$age = 22; // вік
$is_student = true; // чи студентка

// вивід речення
echo "Мене звати $name, мені $age років. ";
echo $is_student ? "Я студентка.<br>" : "Я не студентка.<br>";


// 2. Масив чисел від 1 до 5 та їх сума

$numbers = [1, 2, 3, 4, 5]; // масив чисел
$sum = 0; // змінна для суми

foreach ($numbers as $num) {
    $sum += $num; // додаємо кожен елемент
}

echo "Сума чисел: $sum<br>";


// 3. Асоціативний масив і виведення списку

$user = [
    "name" => "Настя",
    "email" => "Nastia22@gmail.com",
    "phone" => "+380674962348"
];

echo "<ul>";
foreach ($user as $key => $value) {
    echo "<li>$key: $value</li>";
}
echo "</ul>";


// 4. Перевірка віку

if ($age > 18) {
    echo "Користувач повнолітній.<br>";
} else {
    echo "Користувач неповнолітній.<br>";
}


// 5. Оцінка

$grade = 85; // оцінка

if ($grade >= 90 && $grade <= 100) {
    echo "Оцінка: Відмінно";
} elseif ($grade >= 70) {
    echo "Оцінка: Добре";
} elseif ($grade >= 50) {
    echo "Оцінка: Задовільно";
} else {
    echo "Оцінка: Незадовільно";
}
?>